-- phpMyAdmin SQL Dump
-- version 5.2.1deb3
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: אפריל 12, 2026 בזמן 06:18 PM
-- גרסת שרת: 10.11.14-MariaDB-0ubuntu0.24.04.1
-- PHP Version: 8.3.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `dating`
--

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `age`
--

CREATE TABLE `age` (
  `Age_Id` tinyint(4) NOT NULL,
  `Age_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `age`
--

INSERT INTO `age` (`Age_Id`, `Age_Str`) VALUES
(1, '18'),
(2, '19'),
(3, '20'),
(4, '21'),
(5, '22'),
(6, '23'),
(7, '24'),
(8, '25'),
(9, '26'),
(10, '27'),
(11, '28'),
(12, '29'),
(13, '30'),
(14, '31'),
(15, '32'),
(16, '33'),
(17, '34'),
(18, '35'),
(19, '36'),
(20, '37'),
(21, '38'),
(22, '39'),
(23, '40'),
(24, '41'),
(25, '42'),
(26, '43'),
(27, '44'),
(28, '45'),
(29, '46'),
(30, '47'),
(31, '48'),
(32, '49'),
(33, '50'),
(34, '51'),
(35, '52'),
(36, '53'),
(37, '54'),
(38, '55'),
(39, '56'),
(40, '57'),
(41, '58'),
(42, '59'),
(43, '60'),
(44, '61'),
(45, '62'),
(46, '63'),
(47, '64'),
(48, '65'),
(49, '66'),
(50, '67'),
(51, '68'),
(52, '69'),
(53, '70'),
(54, '71'),
(55, '72'),
(56, '73'),
(57, '74'),
(58, '75'),
(59, '76'),
(60, '77'),
(61, '78'),
(62, '79'),
(63, '80'),
(64, '81'),
(65, '82'),
(66, '83'),
(67, '84'),
(68, '85'),
(69, '86'),
(70, '87'),
(71, '88'),
(72, '89'),
(73, '90');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `blocked`
--

CREATE TABLE `blocked` (
  `Num` int(11) NOT NULL,
  `Id` int(11) DEFAULT NULL,
  `Blocked_ById` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `blocked_users`
--

CREATE TABLE `blocked_users` (
  `Num` int(11) NOT NULL,
  `Id` int(11) NOT NULL,
  `Blocked_ById` int(11) NOT NULL,
  `Created_At` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `body_type`
--

CREATE TABLE `body_type` (
  `Body_Type_Id` tinyint(4) NOT NULL,
  `Body_Type_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `body_type`
--

INSERT INTO `body_type` (`Body_Type_Id`, `Body_Type_Str`) VALUES
(1, 'רזה'),
(2, 'שמן'),
(3, 'מלא'),
(4, 'חטוב'),
(5, 'אתלטי'),
(6, 'שמנמן'),
(7, 'ממוצע'),
(8, 'סקסי'),
(9, 'אחר');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `chat_typing`
--

CREATE TABLE `chat_typing` (
  `from_user_id` int(11) NOT NULL,
  `to_user_id` int(11) NOT NULL,
  `is_typing` tinyint(1) NOT NULL DEFAULT 0,
  `updated_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `chat_typing`
--

INSERT INTO `chat_typing` (`from_user_id`, `to_user_id`, `is_typing`, `updated_at`) VALUES
(150, 151, 0, '2026-04-07 23:28:41'),
(151, 150, 0, '2026-04-07 23:51:14'),
(152, 155, 0, '2026-04-08 19:51:27'),
(155, 152, 0, '2026-04-08 19:51:19');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `childs_num`
--

CREATE TABLE `childs_num` (
  `Childs_Num_Id` tinyint(4) NOT NULL,
  `Childs_Num_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `childs_num`
--

INSERT INTO `childs_num` (`Childs_Num_Id`, `Childs_Num_Str`) VALUES
(1, 'ללא ילדים'),
(2, '1'),
(3, '2'),
(4, '3'),
(5, '4'),
(6, '5'),
(7, '6 ומעלה');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `childs_pos`
--

CREATE TABLE `childs_pos` (
  `Childs_Pos_Id` tinyint(4) NOT NULL,
  `Childs_Pos_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `childs_pos`
--

INSERT INTO `childs_pos` (`Childs_Pos_Id`, `Childs_Pos_Str`) VALUES
(1, 'משמורת משותפת'),
(2, 'לא גרים איתי'),
(3, 'גרים איתי'),
(4, 'הסדרי ראיה'),
(5, 'הסדרי ראיה ולינה');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `drinking_habbit`
--

CREATE TABLE `drinking_habbit` (
  `Drinking_Habbit_Id` tinyint(4) NOT NULL,
  `Drinking_Habbit_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `drinking_habbit`
--

INSERT INTO `drinking_habbit` (`Drinking_Habbit_Id`, `Drinking_Habbit_Str`) VALUES
(1, 'באירועים'),
(2, 'מדי פעם'),
(3, 'באופן קבוע');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `economic`
--

CREATE TABLE `economic` (
  `Economic_Id` tinyint(4) NOT NULL,
  `Economic_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `economic`
--

INSERT INTO `economic` (`Economic_Id`, `Economic_Str`) VALUES
(1, 'אמיד'),
(2, 'מבוסס'),
(3, 'ממוצע'),
(4, 'מתחת לממוצע'),
(5, 'חסר אמצעים'),
(6, 'אחר');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `education`
--

CREATE TABLE `education` (
  `Education_Id` tinyint(4) NOT NULL,
  `Education_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `education`
--

INSERT INTO `education` (`Education_Id`, `Education_Str`) VALUES
(1, 'אחר'),
(2, 'דוקטורט'),
(3, 'הנדסאי'),
(4, 'יסודי'),
(5, 'מהנדס'),
(6, 'סטודנט.תלמיד'),
(7, 'על תיכונית'),
(8, 'תואר ראשון'),
(9, 'תואר שני'),
(10, 'תיכון');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `family_status`
--

CREATE TABLE `family_status` (
  `Family_Status_Id` tinyint(4) NOT NULL,
  `Family_Status_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `family_status`
--

INSERT INTO `family_status` (`Family_Status_Id`, `Family_Status_Str`) VALUES
(1, 'רווק'),
(2, 'רווקה'),
(3, 'גרוש'),
(4, 'גרושה'),
(5, 'אלמן'),
(6, 'אלמנה'),
(7, 'פרוד'),
(8, 'פרודה');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `gender`
--

CREATE TABLE `gender` (
  `Gender_Id` tinyint(4) NOT NULL,
  `Gender_Str` varchar(8) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `gender`
--

INSERT INTO `gender` (`Gender_Id`, `Gender_Str`) VALUES
(1, 'גבר'),
(2, 'אישה');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `hair_color`
--

CREATE TABLE `hair_color` (
  `Hair_Color_Id` tinyint(4) NOT NULL,
  `Hair_Color_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `hair_color`
--

INSERT INTO `hair_color` (`Hair_Color_Id`, `Hair_Color_Str`) VALUES
(1, 'שחור'),
(2, 'חום'),
(3, 'בלונדיני'),
(4, 'ג\'ינג\'י'),
(5, 'שטני'),
(6, 'הרבה צבעים'),
(7, 'אפור'),
(8, 'לבן'),
(9, 'אחר');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `hair_type`
--

CREATE TABLE `hair_type` (
  `Hair_Type_Id` tinyint(4) NOT NULL,
  `Hair_Type_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `hair_type`
--

INSERT INTO `hair_type` (`Hair_Type_Id`, `Hair_Type_Str`) VALUES
(1, 'קצר'),
(2, 'ארוך'),
(3, 'חלק'),
(4, 'מתולתל'),
(5, 'גלי'),
(6, 'מקריח'),
(7, 'קרחת'),
(8, 'מגולח');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `height`
--

CREATE TABLE `height` (
  `Height_Id` int(11) NOT NULL,
  `Height_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `height`
--

INSERT INTO `height` (`Height_Id`, `Height_Str`) VALUES
(1, '140  ס\"מ'),
(2, '141  ס\"מ'),
(3, '142  ס\"מ'),
(4, '143  ס\"מ'),
(5, '144  ס\"מ'),
(6, '145  ס\"מ'),
(7, '146  ס\"מ'),
(8, '147  ס\"מ'),
(9, '148  ס\"מ'),
(10, '149  ס\"מ'),
(11, '150  ס\"מ'),
(12, '151  ס\"מ'),
(13, '152  ס\"מ'),
(14, '153  ס\"מ'),
(15, '154  ס\"מ'),
(16, '155  ס\"מ'),
(17, '156  ס\"מ'),
(18, '157  ס\"מ'),
(19, '158  ס\"מ'),
(20, '159  ס\"מ'),
(21, '160  ס\"מ'),
(22, '161  ס\"מ'),
(23, '162  ס\"מ'),
(24, '163  ס\"מ'),
(25, '164  ס\"מ'),
(26, '165  ס\"מ'),
(27, '166  ס\"מ'),
(28, '167  ס\"מ'),
(29, '168  ס\"מ'),
(30, '169  ס\"מ'),
(31, '170  ס\"מ'),
(32, '171  ס\"מ'),
(33, '172  ס\"מ'),
(34, '173  ס\"מ'),
(35, '174  ס\"מ'),
(36, '175  ס\"מ'),
(37, '176  ס\"מ'),
(38, '177  ס\"מ'),
(39, '178  ס\"מ'),
(40, '179  ס\"מ'),
(41, '180  ס\"מ'),
(42, '181  ס\"מ'),
(43, '182  ס\"מ'),
(44, '183  ס\"מ'),
(45, '184  ס\"מ'),
(46, '185  ס\"מ'),
(47, '186  ס\"מ'),
(48, '187  ס\"מ'),
(49, '188  ס\"מ'),
(50, '189  ס\"מ'),
(51, '190  ס\"מ'),
(52, '191  ס\"מ'),
(53, '192  ס\"מ'),
(54, '193  ס\"מ'),
(55, '194  ס\"מ'),
(56, '195  ס\"מ'),
(57, '196  ס\"מ'),
(58, '197  ס\"מ'),
(59, '198  ס\"מ'),
(60, '199  ס\"מ'),
(61, '200  ס\"מ'),
(62, '201  ס\"מ'),
(63, '202  ס\"מ'),
(64, '203  ס\"מ'),
(65, '204  ס\"מ'),
(66, '205  ס\"מ'),
(67, '206  ס\"מ'),
(68, '207  ס\"מ'),
(69, '208  ס\"מ'),
(70, '209  ס\"מ'),
(71, '210  ס\"מ'),
(72, '211  ס\"מ'),
(73, '212  ס\"מ'),
(74, '213  ס\"מ'),
(75, '214  ס\"מ'),
(76, '215  ס\"מ'),
(77, '216  ס\"מ'),
(78, '217  ס\"מ'),
(79, '218  ס\"מ'),
(80, '219  ס\"מ');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `langs`
--

CREATE TABLE `langs` (
  `Lang_Id` tinyint(4) NOT NULL,
  `Lang_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `langs`
--

INSERT INTO `langs` (`Lang_Id`, `Lang_Str`) VALUES
(1, 'איטלקית'),
(2, 'אמהרית'),
(3, 'אנגלית'),
(4, 'בולגרית'),
(5, 'גרמנית'),
(6, 'הולנדית'),
(7, 'הונגרית'),
(8, 'טורקית'),
(9, 'יוונית'),
(10, 'יידיש'),
(11, 'יפנית'),
(12, 'מרוקאית'),
(13, 'סינית'),
(14, 'סלובקית'),
(15, 'ספרדית'),
(16, 'עברית'),
(17, 'ערבית'),
(18, 'פולנית'),
(19, 'פורטוגזית'),
(20, 'פרסית'),
(21, 'צרפתית'),
(22, 'רומנית'),
(23, 'רוסית');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `look_gender`
--

CREATE TABLE `look_gender` (
  `Id` int(11) NOT NULL,
  `Str` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- הוצאת מידע עבור טבלה `look_gender`
--

INSERT INTO `look_gender` (`Id`, `Str`) VALUES
(1, 'גבר'),
(2, 'אישה');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `look_type`
--

CREATE TABLE `look_type` (
  `Look_Type_Id` tinyint(4) NOT NULL,
  `Look_Type_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `look_type`
--

INSERT INTO `look_type` (`Look_Type_Id`, `Look_Type_Str`) VALUES
(1, 'טוב מאוד'),
(2, 'טוב'),
(3, 'ממוצע'),
(4, 'מתחת לממוצע');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `messages`
--

CREATE TABLE `messages` (
  `Msg_Num` int(11) NOT NULL,
  `Id` int(11) DEFAULT NULL,
  `ById` int(11) DEFAULT NULL,
  `Date_Sent` datetime DEFAULT NULL,
  `Msg_Txt` mediumtext DEFAULT NULL,
  `New` tinyint(4) DEFAULT NULL,
  `Deleted_By_Id` tinyint(4) DEFAULT 0,
  `Deleted_By_ById` tinyint(4) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `messages`
--

INSERT INTO `messages` (`Msg_Num`, `Id`, `ById`, `Date_Sent`, `Msg_Txt`, `New`, `Deleted_By_Id`, `Deleted_By_ById`) VALUES
(286, 156, 157, '2026-04-10 20:31:38', 'עגעככגעכגע', 0, 0, 0),
(287, 157, 156, '2026-04-10 20:32:45', 'טאטאאאטאט', 0, 0, 0),
(288, 156, 157, '2026-04-10 20:42:38', 'כיעככטכגו', 0, 0, 0),
(289, 156, 157, '2026-04-11 10:12:36', 'עכעככעכ', 0, 0, 0),
(290, 156, 157, '2026-04-11 10:23:45', 'ןווןווןםםןו', 0, 0, 0),
(291, 156, 157, '2026-04-11 10:59:08', 'םפפםםםם', 0, 0, 0),
(292, 156, 157, '2026-04-11 11:01:00', 'חחןווון', 0, 0, 0),
(293, 156, 157, '2026-04-11 11:05:02', 'וטוטווטטוטוט', 0, 0, 0),
(294, 156, 157, '2026-04-11 11:05:21', 'עעטאטאאאא', 0, 0, 0),
(295, 156, 157, '2026-04-11 11:07:20', 'טאאטאאאאט', 0, 0, 0),
(296, 156, 157, '2026-04-11 18:13:06', 'ytuuuuuuuuuuuuuuu', 0, 0, 0),
(297, 156, 157, '2026-04-11 18:13:58', 'uihhujji', 0, 0, 0),
(298, 156, 157, '2026-04-11 18:14:12', 'ffftfy', 0, 0, 0),
(299, 158, 157, '2026-04-11 22:18:57', 'קאאטקטאקרא', 0, 0, 0),
(300, 158, 157, '2026-04-11 23:29:39', 'וטטוטטטו', 0, 0, 0),
(301, 158, 157, '2026-04-12 04:28:24', 'וןוו', 0, 0, 0),
(302, 157, 158, '2026-04-12 05:21:18', 'חלחלךחח', 1, 0, 0);

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `message_typing`
--

CREATE TABLE `message_typing` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `target_id` int(11) NOT NULL,
  `updated_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `occupation`
--

CREATE TABLE `occupation` (
  `Occupation_Id` tinyint(4) NOT NULL,
  `Occupation_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `occupation`
--

INSERT INTO `occupation` (`Occupation_Id`, `Occupation_Str`) VALUES
(1, 'אדריכלות'),
(2, 'אופנה'),
(3, 'אחר'),
(4, 'אינטרנט'),
(5, 'אמנות'),
(6, 'אירוח'),
(7, 'ביטוח'),
(8, 'ביטחון'),
(9, 'בניה'),
(10, 'בנקאות'),
(11, 'בקרת איכות'),
(12, 'בריאות'),
(13, 'גימלאי'),
(14, 'גננת'),
(15, 'עוזרת גננת'),
(16, 'בידור'),
(17, 'גרפיקה'),
(18, 'דוגמנות'),
(19, 'הוראה / הדרכה'),
(20, 'היי-טק'),
(21, 'הנדסה אזרחית'),
(22, 'הנדסת אלקטרוניקה'),
(23, 'הנדסת מחשבים'),
(24, 'הנדסת מכונות'),
(25, 'הנדסת תעשיה וניהול'),
(26, 'הנה\"ח'),
(27, 'הפקה'),
(28, 'חשמלאות'),
(29, 'יחסי ציבור'),
(30, 'ייעוץ'),
(31, 'מובטל'),
(32, 'מוזיקה'),
(33, 'מחקר'),
(34, 'מחשבים'),
(35, 'מכונאות'),
(36, 'מכירות'),
(37, 'מנהלה'),
(38, 'מסחר'),
(39, 'משאבי אנוש'),
(40, 'משטרה'),
(41, 'ניהול'),
(42, 'ניהול בכיר'),
(43, 'נסיעות / תיירות'),
(44, 'סגל אקדמי'),
(45, 'סיעוד'),
(46, 'עבודה סוציאלית'),
(47, 'עיצוב'),
(48, 'עצמאי'),
(49, 'עריכת דין'),
(50, 'שיפוט'),
(51, 'פיננסים / נכסים'),
(52, 'פירסום'),
(53, 'פסיכולוגיה'),
(54, 'פקידות'),
(55, 'צבא קבע'),
(56, 'צילום'),
(57, 'קוסמטיקה'),
(58, 'ראיית חשבון'),
(59, 'רוקחות'),
(60, 'רפואה'),
(61, 'שירות'),
(62, 'שירות המדינה'),
(63, 'שירות לקוחות'),
(64, 'תוכנה'),
(65, 'תחבורה'),
(66, 'תחזוקה / שיפוצים'),
(67, 'תקשורת'),
(68, 'חומרה');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `origin`
--

CREATE TABLE `origin` (
  `Origin_Id` tinyint(4) NOT NULL,
  `Origin_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `origin`
--

INSERT INTO `origin` (`Origin_Id`, `Origin_Str`) VALUES
(1, 'ספרדי'),
(2, 'אשכנזי'),
(3, 'דרוזי'),
(4, 'ערבי'),
(5, 'מעורב'),
(6, 'אחר');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `place`
--

CREATE TABLE `place` (
  `Place_Id` int(11) NOT NULL,
  `Place_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `place`
--

INSERT INTO `place` (`Place_Id`, `Place_Str`) VALUES
(6142, 'אבטליון\r'),
(6143, 'אביאל\r'),
(6144, 'אביבים\r'),
(6145, 'אביגדור\r'),
(6146, 'אביחיל\r'),
(6147, 'אביטל\r'),
(6148, 'אביעזר\r'),
(6149, 'אבירים\r'),
(6150, 'אבן יהודה\r'),
(6151, 'אבן יצחק\r'),
(6152, 'אבן מנחם\r'),
(6153, 'אבן ספיר\r'),
(6154, 'אבן שמואל\r'),
(6155, 'אבני איתן\r'),
(6156, 'אבני חפץ\r'),
(6157, 'אדירים\r'),
(6158, 'אדמית\r'),
(6159, 'אדרת\r'),
(6160, 'אודים\r'),
(6161, 'אודם\r'),
(6162, 'אוהד\r'),
(6163, 'אומץ\r'),
(6164, 'אופקים\r'),
(6165, 'אור הגנוז\r'),
(6166, 'אור הנר\r'),
(6167, 'אור יהודה\r'),
(6168, 'אור עקיבא\r'),
(6169, 'אורה\r'),
(6170, 'אורות\r'),
(6171, 'אורטל\r'),
(6172, 'אורים\r'),
(6173, 'אורנית\r'),
(6174, 'אושרת\r'),
(6175, 'אזור\r'),
(6176, 'אחווה\r'),
(6177, 'אחוזם\r'),
(6178, 'אחיהוד\r'),
(6179, 'אחיטוב\r'),
(6180, 'אחיסמך\r'),
(6181, 'אחיעזר\r'),
(6182, 'אייל\r'),
(6183, 'איילת השחר\r'),
(6184, 'אילון\r'),
(6185, 'אילות\r'),
(6186, 'אילניה\r'),
(6187, 'אילת\r'),
(6188, 'איתמר\r'),
(6189, 'איתן\r'),
(6190, 'איתנים\r'),
(6191, 'אלומה\r'),
(6192, 'אלומות\r'),
(6193, 'אלון\r'),
(6194, 'אלון הגליל\r'),
(6195, 'אלון מורה\r'),
(6196, 'אלון שבות\r'),
(6197, 'אלוני אבא\r'),
(6198, 'אלוני הבשן\r'),
(6199, 'אלוני יצחק\r'),
(6200, 'אלונים\r'),
(6201, 'אילי סיני\r'),
(6202, 'אליעד\r'),
(6203, 'אליכין\r'),
(6204, 'אליפז\r'),
(6205, 'אליפלט\r'),
(6206, 'אליקים\r'),
(6207, 'אלישיב\r'),
(6208, 'אלישמע\r'),
(6209, 'אלמגור\r'),
(6210, 'אלמוג\r'),
(6211, 'אלעזר\r'),
(6212, 'אלפי מנשה\r'),
(6213, 'אלקוש\r'),
(6214, 'אלקנה\r'),
(6215, 'אלרום\r'),
(6216, 'אמונים\r'),
(6217, 'אמירים\r'),
(6218, 'אמנון\r'),
(6219, 'אמציה\r'),
(6220, 'אניעם\r'),
(6221, 'אפיק\r'),
(6222, 'אפק\r'),
(6223, 'אפרת\r'),
(6224, 'ארבל\r'),
(6225, 'ארגמן\r'),
(6226, 'ארז\r'),
(6227, 'אריאל\r'),
(6228, 'אשבול\r'),
(6229, 'אשדוד\r'),
(6230, 'אשדות יעקב\r'),
(6231, 'אשחר\r'),
(6232, 'אשכולות\r'),
(6233, 'אשלים\r'),
(6234, 'אשקלון\r'),
(6235, 'אשתאול\r'),
(6236, 'באר טוביה\r'),
(6237, 'באר יעקב\r'),
(6238, 'באר שבע\r'),
(6239, 'בארות יצחק\r'),
(6240, 'בארותיים\r'),
(6241, 'בארי\r'),
(6242, 'בדולח\r'),
(6243, 'בוסתן הגליל\r'),
(6244, 'בורגתה\r'),
(6245, 'בחן\r'),
(6246, 'ביצרון\r'),
(6247, 'בית אורן\r'),
(6248, 'בית אל\r'),
(6249, 'בית אלעזרי\r'),
(6250, 'בית אלפא\r'),
(6251, 'בית אריה\r'),
(6252, 'בית ברל\r'),
(6253, 'בית גוברין\r'),
(6254, 'בית גמליאל\r'),
(6255, 'בית ג\'ן\r'),
(6256, 'בית דגן\r'),
(6257, 'בית הגדי\r'),
(6258, 'בית הילל\r'),
(6259, 'בית הלוי\r'),
(6260, 'בית העמק\r'),
(6261, 'בית הערבה\r'),
(6262, 'בית השיטה\r'),
(6263, 'בית זית\r'),
(6264, 'בית זרע\r'),
(6265, 'בית חגי\r'),
(6266, 'בית חורון\r'),
(6267, 'בית חנן\r'),
(6268, 'בית חנניה\r'),
(6269, 'בית חרות\r'),
(6270, 'בית חשמונאי\r'),
(6271, 'בית יהושוע\r'),
(6272, 'בית יוסף\r'),
(6273, 'בית ינאי\r'),
(6274, 'בית יצחק\r'),
(6275, 'בית לחם הגלילית\r'),
(6276, 'בית ליד\r'),
(6277, 'בית מאיר\r'),
(6278, 'בית מירסים\r'),
(6279, 'בית נחמיה\r'),
(6280, 'בית ניר\r'),
(6281, 'בית נקופה\r'),
(6282, 'בית עובד\r'),
(6283, 'בית עוזיאל\r'),
(6284, 'בית עזרא\r'),
(6285, 'בית קמה\r'),
(6286, 'בית קשת\r'),
(6287, 'בית רבן\r'),
(6288, 'בית רימון\r'),
(6289, 'בית שאן\r'),
(6290, 'בית שמש\r'),
(6291, 'בית שערים\r'),
(6292, 'בית שקמה\r'),
(6293, 'ביתן אהרון\r'),
(6294, 'ביתר\r'),
(6295, 'בן זכאי\r'),
(6296, 'בן עמי\r'),
(6297, 'בן שמן\r'),
(6298, 'בני ברק\r'),
(6299, 'בני דרום\r'),
(6300, 'בני דרור\r'),
(6301, 'בני יהודה\r'),
(6302, 'בני נעים\r'),
(6303, 'בני עטרות\r'),
(6304, 'בני עי ש\r'),
(6305, 'בני עצמון\r'),
(6306, 'בני ציון\r'),
(6307, 'בני רא ם\r'),
(6308, 'בניה\r'),
(6309, 'בנימינה\r'),
(6310, 'בסמת טבעון\r'),
(6311, 'בצרה\r'),
(6312, 'בצת\r'),
(6313, 'בקוע\r'),
(6314, 'בקעות\r'),
(6315, 'בר גיורא\r'),
(6316, 'בר יוחאי\r'),
(6317, 'ברור חיל\r'),
(6318, 'ברוש\r'),
(6319, 'ברכה\r'),
(6320, 'ברעם\r'),
(6321, 'ברק\r'),
(6322, 'ברקאי\r'),
(6323, 'ברקן\r'),
(6324, 'ברקת\r'),
(6325, 'בת חפר\r'),
(6326, 'בת ים\r'),
(6327, 'בת עין\r'),
(6328, 'בת שלמה\r'),
(6329, 'גאולי תימן\r'),
(6330, 'גאולים\r'),
(6331, 'גבולות\r'),
(6332, 'גבים\r'),
(6333, 'גבע\r'),
(6334, 'גבע בנימין\r'),
(6335, 'גבע כרמל\r'),
(6336, 'גבעולים\r'),
(6337, 'גבעון החדשה\r'),
(6338, 'גבעת אבני\r'),
(6339, 'גבעת אלה\r'),
(6340, 'גבעת ברנר\r'),
(6341, 'גבעת השלושה\r'),
(6342, 'גבעת זאב\r'),
(6343, 'גבעת חיים\r'),
(6344, 'גבעת ח ן\r'),
(6345, 'גבעת יואב\r'),
(6346, 'גבעת יערים\r'),
(6347, 'גבעת ישעיהו\r'),
(6348, 'גבעת נילי\r'),
(6349, 'גבעת עדה\r'),
(6350, 'גבעת עוז\r'),
(6351, 'גבעת שמואל\r'),
(6352, 'גבעת שפירא\r'),
(6353, 'גבעתי\r'),
(6354, 'גבעתיים\r'),
(6355, 'גברעם\r'),
(6356, 'גבת\r'),
(6357, 'גדות\r'),
(6358, 'גדיד\r'),
(6359, 'גדיש\r'),
(6360, 'גדעונה\r'),
(6361, 'גדרה\r'),
(6362, 'גונן\r'),
(6363, 'גורן\r'),
(6364, 'גורנות הגליל\r'),
(6365, 'גזית\r'),
(6366, 'גזר\r'),
(6367, 'גיאה\r'),
(6368, 'גיבתון\r'),
(6369, 'גיזו\r'),
(6370, 'גילגל\r'),
(6371, 'גילון\r'),
(6372, 'גילת\r'),
(6373, 'גינוסר\r'),
(6374, 'גינתון\r'),
(6375, 'גיתה\r'),
(6376, 'גיתית\r'),
(6377, 'גלאון\r'),
(6378, 'גליל ים\r'),
(6379, 'גלעד\r'),
(6380, 'גמזו\r'),
(6381, 'גן אור\r'),
(6382, 'גן הדרום\r'),
(6383, 'גן השומרון\r'),
(6384, 'גן חיים\r'),
(6385, 'גן יאשיה\r'),
(6386, 'גן יבנה\r'),
(6387, 'גן נר\r'),
(6388, 'גן שורק\r'),
(6389, 'גן שלמה\r'),
(6390, 'גן שמואל\r'),
(6391, 'גנות\r'),
(6392, 'גנות הדר\r'),
(6393, 'גני הדר\r'),
(6394, 'גני טל\r'),
(6395, 'גני יהודה\r'),
(6396, 'גני יוחנן\r'),
(6397, 'גני תקווה\r'),
(6398, 'גניגר\r'),
(6399, 'גנים\r'),
(6400, 'געש\r'),
(6401, 'געתון\r'),
(6402, 'גפן\r'),
(6403, 'גרופית\r'),
(6404, 'גשור\r'),
(6405, 'גשר\r'),
(6406, 'גשר הזיו\r'),
(6407, 'גת\r'),
(6408, 'דליאת א-כרמל\r'),
(6409, 'דבורה\r'),
(6410, 'דביר\r'),
(6411, 'דגניה\r'),
(6412, 'דובב\r'),
(6413, 'דוברת\r'),
(6414, 'דוגית\r'),
(6415, 'דולב\r'),
(6416, 'דור\r'),
(6417, 'דורות\r'),
(6418, 'דימונה\r'),
(6419, 'דישון\r'),
(6420, 'דליה\r'),
(6421, 'דלתון\r'),
(6422, 'דן\r'),
(6423, 'דפנה\r'),
(6424, 'דקל\r'),
(6425, 'האון\r'),
(6426, 'הבונים\r'),
(6427, 'הגושרים\r'),
(6428, 'הדר עם\r'),
(6429, 'הוד השרון\r'),
(6430, 'הודיה\r'),
(6431, 'הודיות\r'),
(6432, 'הושעיה\r'),
(6433, 'הזורע\r'),
(6434, 'הזורעים\r'),
(6435, 'החותרים\r'),
(6436, 'היוגב\r'),
(6437, 'הילה\r'),
(6438, 'המעפיל\r'),
(6439, 'הנשיא\r'),
(6440, 'הסוללים\r'),
(6441, 'העוגן\r'),
(6442, 'הר אדר\r'),
(6443, 'הראל\r'),
(6444, 'הרדוף\r'),
(6445, 'הרצליה\r'),
(6446, 'הררית\r'),
(6447, 'ורד ירחו\r'),
(6448, 'זוהר\r'),
(6449, 'זימרת\r'),
(6450, 'זיקים\r'),
(6451, 'זיתן\r'),
(6452, 'זיכרון יעקב\r'),
(6453, 'זכריה\r'),
(6454, 'זנוח\r'),
(6455, 'זרועה\r'),
(6456, 'זרזיר\r'),
(6457, 'זרחיה\r'),
(6458, 'זרעית\r'),
(6459, 'חבצלת השרון\r'),
(6460, 'חברון\r'),
(6461, 'חגור\r'),
(6462, 'חד נס\r'),
(6463, 'חדרה\r'),
(6464, 'חולדה\r'),
(6465, 'חולון\r'),
(6466, 'חולית\r'),
(6467, 'חולתה\r'),
(6468, 'חומש\r'),
(6469, 'חוסן\r'),
(6470, 'חופית\r'),
(6471, 'חוקוק\r'),
(6472, 'חורה\r'),
(6473, 'חורפיש\r'),
(6474, 'חורשים\r'),
(6475, 'חזון\r'),
(6476, 'חיבת ציון\r'),
(6477, 'חיננית\r'),
(6478, 'חיפה\r'),
(6479, 'חלוץ\r'),
(6480, 'חלמיש\r'),
(6481, 'חלץ\r'),
(6482, 'חמד\r'),
(6483, 'חמדיה\r'),
(6484, 'חמרה\r'),
(6485, 'חניאל\r'),
(6486, 'חניתה\r'),
(6487, 'חנתון\r'),
(6488, 'חספין\r'),
(6489, 'חפץ חיים\r'),
(6490, 'חפצי-בה\r'),
(6491, 'חצב\r'),
(6492, 'חצבה\r'),
(6493, 'חצור אשדוד\r'),
(6494, 'חצור הגלילית\r'),
(6495, 'חצרות יסף\r'),
(6496, 'חצרים\r'),
(6497, 'חרב לאת\r'),
(6498, 'חרוצים\r'),
(6499, 'חרות\r'),
(6500, 'חריש\r'),
(6501, 'חרמש\r'),
(6502, 'חרשים\r'),
(6503, 'חשמונאים\r'),
(6504, 'טבעון\r'),
(6505, 'טבריה\r'),
(6506, 'טירת יהודה\r'),
(6507, 'טירת כרמל\r'),
(6508, 'טירת צבי\r'),
(6509, 'טל שחר\r'),
(6510, 'טללים\r'),
(6511, 'טלמון\r'),
(6512, 'טנא\r'),
(6513, 'טפחות\r'),
(6514, 'יאנוח\r'),
(6515, 'יבול\r'),
(6516, 'יבנאל\r'),
(6517, 'יבנה\r'),
(6518, 'יגור\r'),
(6519, 'יגל\r'),
(6520, 'יד בנימין\r'),
(6521, 'יד השמונה\r'),
(6522, 'יד חנה\r'),
(6523, 'יד מרדכי\r'),
(6524, 'יד נתן\r'),
(6525, 'יד רמבם\r'),
(6526, 'ידידיה\r'),
(6527, 'יהוד\r'),
(6528, 'יהל\r'),
(6529, 'יובל\r'),
(6530, 'יובלים\r'),
(6531, 'יודפת\r'),
(6532, 'יוטבתה\r'),
(6533, 'יונתן\r'),
(6534, 'יוקנעם\r'),
(6535, 'יושיביה\r'),
(6536, 'יזרעאל\r'),
(6537, 'יחיעם\r'),
(6538, 'ייטב\r'),
(6539, 'יינון\r'),
(6540, 'יכיני\r'),
(6541, 'ינוב\r'),
(6542, 'יסוד המעלה\r'),
(6543, 'יסודות\r'),
(6544, 'יסעור\r'),
(6545, 'יעד\r'),
(6546, 'יעלון\r'),
(6547, 'יעף\r'),
(6548, 'יערה\r'),
(6549, 'יערית\r'),
(6550, 'יפו\r'),
(6551, 'יפית\r'),
(6552, 'יפעת\r'),
(6553, 'יפתח\r'),
(6554, 'יצהר\r'),
(6555, 'יציץ\r'),
(6556, 'יקום\r'),
(6557, 'יקיר\r'),
(6558, 'יראון\r'),
(6559, 'ירדנה\r'),
(6560, 'ירוחם\r'),
(6561, 'ירושלים\r'),
(6562, 'ירחיב\r'),
(6563, 'ירכא\r'),
(6564, 'ירקונה\r'),
(6565, 'ישע\r'),
(6566, 'ישעי\r'),
(6567, 'ישרש\r'),
(6568, 'יתד\r'),
(6569, 'כברי\r'),
(6570, 'כדים\r'),
(6571, 'כוכב השחר\r'),
(6572, 'כוכב יאיר\r'),
(6573, 'כוכב יעקב\r'),
(6574, 'כוכב מיכאל\r'),
(6575, 'כורזים\r'),
(6576, 'כחל\r'),
(6577, 'כינרת\r'),
(6578, 'כיסופים\r'),
(6579, 'כלנית\r'),
(6580, 'כנות\r'),
(6581, 'כנף\r'),
(6582, 'כפר אביב\r'),
(6583, 'כפר אדומים\r'),
(6584, 'כפר אוריה\r'),
(6585, 'כפר אזר\r'),
(6586, 'כפר אחים\r'),
(6587, 'כפר ביאליק\r'),
(6588, 'כפר בילו\r'),
(6589, 'כפר בלום\r'),
(6590, 'כפר בן נון\r'),
(6591, 'כפר ברוך\r'),
(6592, 'כפר גדעון\r'),
(6593, 'כפר גלים\r'),
(6594, 'כפר גליקסון\r'),
(6595, 'כפר גילעדי\r'),
(6596, 'כפר דניאל\r'),
(6597, 'כפר דרום\r'),
(6598, 'כפר החורש\r'),
(6599, 'כפר המכבי\r'),
(6600, 'כפר הנגיד\r'),
(6601, 'כפר הנשיא\r'),
(6602, 'כפר הס\r'),
(6603, 'כפר הרואה\r'),
(6604, 'כפר הריף\r'),
(6605, 'כפר ויתקין\r'),
(6606, 'כפר ורבורג\r'),
(6607, 'כפר ורדים\r'),
(6608, 'כפר זיתים\r'),
(6609, 'כפר חבד\r'),
(6610, 'כפר חיטים\r'),
(6611, 'כפר חיים\r'),
(6612, 'כפר חנניה\r'),
(6613, 'כפר חסידים\r'),
(6614, 'כפר חרוב\r'),
(6615, 'כפר טרומן\r'),
(6616, 'כפר יאסיף\r'),
(6617, 'כפר יהושוע\r'),
(6618, 'כפר יונה\r'),
(6619, 'כפר יחזקאל\r'),
(6620, 'כפר יעבץ\r'),
(6621, 'כפר כנא\r'),
(6622, 'כפר מונש\r'),
(6623, 'כפר מימון\r'),
(6624, 'כפר מלל\r'),
(6625, 'כפר מנחם\r'),
(6626, 'כפר מסריק\r'),
(6627, 'כפר מרדכי\r'),
(6628, 'כפר נטר\r'),
(6629, 'כפר סבא\r'),
(6630, 'כפר סולד\r'),
(6631, 'כפר סילבר\r'),
(6632, 'כפר סירקין\r'),
(6633, 'כפר עזה\r'),
(6634, 'כפר עציון\r'),
(6635, 'כפר פינס\r'),
(6636, 'כפר קדום\r'),
(6637, 'כפר קיש\r'),
(6638, 'כפר קרע\r'),
(6639, 'כפר רופין\r'),
(6640, 'כפר רות\r'),
(6641, 'כפר שמאי\r'),
(6642, 'כפר שמואל\r'),
(6643, 'כפר שמריהו\r'),
(6644, 'כפר תבור\r'),
(6645, 'כפר תפוח\r'),
(6646, 'כרכום\r'),
(6647, 'כרכור\r'),
(6648, 'כרם בן זמרה\r'),
(6649, 'כרם מהרל\r'),
(6650, 'כרם שלום\r'),
(6651, 'כרמי יוסף\r'),
(6652, 'כרמי צור\r'),
(6653, 'כרמיאל\r'),
(6654, 'כרמיה\r'),
(6655, 'כרמים\r'),
(6656, 'כרמל\r'),
(6657, 'לבון\r'),
(6658, 'לביא\r'),
(6659, 'להב\r'),
(6660, 'להבות הבשן\r'),
(6661, 'להבות חביבה\r'),
(6662, 'להבים\r'),
(6663, 'לוד\r'),
(6664, 'לוחמי הגטאות\r'),
(6665, 'לוטם\r'),
(6666, 'לוטן\r'),
(6667, 'ליבנים\r'),
(6668, 'לימן\r'),
(6669, 'לכיש\r'),
(6670, 'לפידות\r'),
(6671, 'מאור\r'),
(6672, 'מאיר שפיה\r'),
(6673, 'מבוא ביתר\r'),
(6674, 'מבוא דותן\r'),
(6675, 'מבוא חורון\r'),
(6676, 'מבוא חמה\r'),
(6677, 'מבוא מודיעים\r'),
(6678, 'מבועים\r'),
(6679, 'מבטחים\r'),
(6680, 'מבקיעים\r'),
(6681, 'מבשרת ציון\r'),
(6682, 'מגדים\r'),
(6683, 'מגדל\r'),
(6684, 'מגדל העמק\r'),
(6685, 'מגדל עוז\r'),
(6686, 'מגדלים\r'),
(6687, 'מגידו\r'),
(6688, 'מגל\r'),
(6689, 'מגן\r'),
(6690, 'מגן שאול\r'),
(6691, 'מגשימים\r'),
(6692, 'מדרך עוז\r'),
(6693, 'מודיעין\r'),
(6694, 'מולדת\r'),
(6695, 'מוצא\r'),
(6696, 'מורג\r'),
(6697, 'מורן\r'),
(6698, 'מורשת\r'),
(6699, 'מזור\r'),
(6700, 'מזכרת בתיה\r'),
(6701, 'מזרע\r'),
(6702, 'מזרעה\r'),
(6703, 'מחולה\r'),
(6704, 'מחניים\r'),
(6705, 'מטולה\r'),
(6706, 'מטע\r'),
(6707, 'מי עמי\r'),
(6708, 'מיטב\r'),
(6709, 'מיצר\r'),
(6710, 'מירב\r'),
(6711, 'מירון\r'),
(6712, 'מישור אדומים\r'),
(6713, 'מישר\r'),
(6714, 'מיתר\r'),
(6715, 'מכבים\r'),
(6716, 'מכורה\r'),
(6717, 'מכמורת\r'),
(6718, 'מכמנים\r'),
(6719, 'מלאה\r'),
(6720, 'מלילות\r'),
(6721, 'מלכיה\r'),
(6722, 'מלכישוע\r'),
(6723, 'מנוחה\r'),
(6724, 'מנוף\r'),
(6725, 'מנורה\r'),
(6726, 'מנות\r'),
(6727, 'מנחמיה\r'),
(6728, 'מנרה\r'),
(6729, 'מסד\r'),
(6730, 'מסדה\r'),
(6731, 'מסילות\r'),
(6732, 'מסילת ציון\r'),
(6733, 'מעאר\r'),
(6734, 'מעברות\r'),
(6735, 'מעגלים\r'),
(6736, 'מעגן\r'),
(6737, 'מעגן מיכאל\r'),
(6738, 'מעוז חיים\r'),
(6739, 'מעון\r'),
(6740, 'מעונה\r'),
(6741, 'מעיין ברוך\r'),
(6742, 'מעיין צבי\r'),
(6743, 'מעיליה\r'),
(6744, 'מעלה אדומים\r'),
(6745, 'מעלה אפריים\r'),
(6746, 'מעלה גלבוע\r'),
(6747, 'מעלה גמלא\r'),
(6748, 'מעלה החמישה\r'),
(6749, 'מעלה לבונה\r'),
(6750, 'מעלה מיכמש\r'),
(6751, 'מעלה עמוס\r'),
(6752, 'מעלה שומרון\r'),
(6753, 'מעלות תרשיחא\r'),
(6754, 'מענית\r'),
(6755, 'מפלסים\r'),
(6756, 'מצדות יהודה\r'),
(6757, 'מצובה\r'),
(6758, 'מצליח\r'),
(6759, 'מצפה\r'),
(6760, 'מצפה אביב\r'),
(6761, 'מצפה יריחו\r'),
(6762, 'מצפה נטופה\r'),
(6763, 'מצפה רמון\r'),
(6764, 'מצפה שלם\r'),
(6765, 'מצר\r'),
(6766, 'מרגליות\r'),
(6767, 'מרום גולן\r'),
(6768, 'מרחביה\r'),
(6769, 'משאבי שדה\r'),
(6770, 'משגב דב\r'),
(6771, 'משגב עם\r'),
(6772, 'משואה\r'),
(6773, 'משואות יצחק\r'),
(6774, 'משמר איילון\r'),
(6775, 'משמר דוד\r'),
(6776, 'משמר הירדן\r'),
(6777, 'משמר הנגב\r'),
(6778, 'משמר העמק\r'),
(6779, 'משמר השבעה\r'),
(6780, 'משמר השרון\r'),
(6781, 'משמרות\r'),
(6782, 'משמרת\r'),
(6783, 'משען\r'),
(6784, 'מתן\r'),
(6785, 'מתת\r'),
(6786, 'מתתיהו\r'),
(6787, 'נאות גולן\r'),
(6788, 'נאות הכיכר\r'),
(6789, 'נאות מרדכי\r'),
(6790, 'נבטים\r'),
(6791, 'נגבה\r'),
(6792, 'נהורה\r'),
(6793, 'נהלל\r'),
(6794, 'נהריה\r'),
(6795, 'נוב\r'),
(6796, 'נוגה\r'),
(6797, 'נווה אור\r'),
(6798, 'נווה אטיב\r'),
(6799, 'נווה אילן\r'),
(6800, 'נווה איתן\r'),
(6801, 'נווה אפרים\r'),
(6802, 'נווה דניאל\r'),
(6803, 'נווה דקלים\r'),
(6804, 'נווה זוהר\r'),
(6805, 'נווה חריף\r'),
(6806, 'נווה ים\r'),
(6807, 'נווה ימין\r'),
(6808, 'נווה ירק\r'),
(6809, 'נווה מבטח\r'),
(6810, 'נווה מיכאל\r'),
(6811, 'נווה עובד\r'),
(6812, 'נווה שלום\r'),
(6813, 'נועם\r'),
(6814, 'נופים\r'),
(6815, 'נופך\r'),
(6816, 'נוקדים\r'),
(6817, 'נורדיה\r'),
(6818, 'נחושה\r'),
(6819, 'נחל אבנת\r'),
(6820, 'נחל אלישע\r'),
(6821, 'נחל אשבל\r'),
(6822, 'נחל גבעות\r'),
(6823, 'נחל חמדת\r'),
(6824, 'נחל משכיות\r'),
(6825, 'נחל נמרוד\r'),
(6826, 'נחל עוז\r'),
(6827, 'נחל רותם\r'),
(6828, 'נחל רחלים\r'),
(6829, 'נחלה\r'),
(6830, 'נחליאל\r'),
(6831, 'נחלים\r'),
(6832, 'נחם\r'),
(6833, 'נחף\r'),
(6834, 'נחשולים\r'),
(6835, 'נחשון\r'),
(6836, 'נחשונים\r'),
(6837, 'נטועה\r'),
(6838, 'נטור\r'),
(6839, 'נטעים\r'),
(6840, 'נטף\r'),
(6841, 'נילי\r'),
(6842, 'ניסנית\r'),
(6843, 'ניצני סיני\r'),
(6844, 'ניצני עוז\r'),
(6845, 'ניצנים\r'),
(6846, 'ניר אליהו\r'),
(6847, 'ניר בנים\r'),
(6848, 'ניר גלים\r'),
(6849, 'ניר דוד\r'),
(6850, 'ניר חן\r'),
(6851, 'ניר יפה\r'),
(6852, 'ניר יצחק\r'),
(6853, 'ניר ישראל\r'),
(6854, 'ניר משה\r'),
(6855, 'ניר עוז\r'),
(6856, 'ניר עם\r'),
(6857, 'ניר עציון\r'),
(6858, 'ניר עקיבא\r'),
(6859, 'ניר צבי\r'),
(6860, 'נירים\r'),
(6861, 'נירית\r'),
(6862, 'נס הרים\r'),
(6863, 'נס עמים\r'),
(6864, 'נס ציונה\r'),
(6865, 'נערן\r'),
(6866, 'נעורים\r'),
(6867, 'נעלה\r'),
(6868, 'נעמה\r'),
(6869, 'נען\r'),
(6870, 'נצר חזני\r'),
(6871, 'נצר סרני\r'),
(6872, 'נצרים\r'),
(6873, 'נצרת עלית\r'),
(6874, 'נשר\r'),
(6875, 'נתיב הגדוד\r'),
(6876, 'נתיב הלה\r'),
(6877, 'נתיב העשרה\r'),
(6878, 'נתיב השיירה\r'),
(6879, 'נתיבות\r'),
(6880, 'נתניה\r'),
(6881, 'סאסא\r'),
(6882, 'סביון\r'),
(6883, 'סבסטיה\r'),
(6884, 'סגולה\r'),
(6885, 'סג ור\r'),
(6886, 'סוסיה\r'),
(6887, 'סופה\r'),
(6888, 'סלעית\r'),
(6889, 'סעד\r'),
(6890, 'ספיר\r'),
(6891, 'עברון\r'),
(6892, 'עגור\r'),
(6893, 'עדי\r'),
(6894, 'עולש\r'),
(6895, 'עומר\r'),
(6896, 'עופר\r'),
(6897, 'עופרה\r'),
(6898, 'עופרים\r'),
(6899, 'עוצם\r'),
(6900, 'עותניאל\r'),
(6901, 'עזוז\r'),
(6902, 'עזר\r'),
(6903, 'עזריאל\r'),
(6904, 'עזריה\r'),
(6905, 'עזריקם\r'),
(6906, 'עטרת\r'),
(6907, 'עידן\r'),
(6908, 'עיינות\r'),
(6909, 'עין איילה\r'),
(6910, 'עין גב\r'),
(6911, 'עין גדי\r'),
(6912, 'עין דור\r'),
(6913, 'עין הבשור\r'),
(6914, 'עין הוד\r'),
(6915, 'עין החורש\r'),
(6916, 'עין המפרץ\r'),
(6917, 'עין הנציב\r'),
(6918, 'עין העמק\r'),
(6919, 'עין השופט\r'),
(6920, 'עין השלושה\r'),
(6921, 'עין ורד\r'),
(6922, 'עין זיוון\r'),
(6923, 'עין חוד\r'),
(6924, 'עין חצבה\r'),
(6925, 'עין חרוד\r'),
(6926, 'עין יהב\r'),
(6927, 'עין יעקב\r'),
(6928, 'עין כרמל\r'),
(6929, 'עין מאהל\r'),
(6930, 'עין עירון\r'),
(6931, 'עין צורים\r'),
(6932, 'עין שמר\r'),
(6933, 'עין שריד\r'),
(6934, 'עין תמר\r'),
(6935, 'עינת\r'),
(6936, 'עוספיא\r'),
(6937, 'עכו\r'),
(6938, 'עלומים\r'),
(6939, 'עלי\r'),
(6940, 'עלי זהב\r'),
(6941, 'עלמה\r'),
(6942, 'עלמון\r'),
(6943, 'עמוקה\r'),
(6944, 'עמינדב\r'),
(6945, 'עמיעד\r'),
(6946, 'עמיעוז\r'),
(6947, 'עמיקם\r'),
(6948, 'עמיר\r'),
(6949, 'עמישב\r'),
(6950, 'עמנואל\r'),
(6951, 'עמקה\r'),
(6952, 'ענב\r'),
(6953, 'עפולה\r'),
(6954, 'עץ אפרים\r'),
(6955, 'ערבונה\r'),
(6956, 'ערד\r'),
(6957, 'ערוגות\r'),
(6958, 'ערוער\r'),
(6959, 'עשרת\r'),
(6960, 'עתלית\r'),
(6961, 'פארן\r'),
(6962, 'פאת שדה\r'),
(6963, 'פדואל\r'),
(6964, 'פדויים\r'),
(6965, 'פדייה\r'),
(6966, 'פוריה\r'),
(6967, 'פורת\r'),
(6968, 'פטיש\r'),
(6969, 'פי נר\r'),
(6970, 'פלך\r'),
(6971, 'פלמחים\r'),
(6972, 'פני חבר\r'),
(6973, 'פסגות\r'),
(6974, 'פעמי תשז\r'),
(6975, 'פצאל\r'),
(6976, 'פקיעין\r'),
(6977, 'פרדס חנה\r'),
(6978, 'פרדסיה\r'),
(6979, 'פרי גן\r'),
(6980, 'פתח תקווה\r'),
(6981, 'פתחיה\r'),
(6982, 'צאלים\r'),
(6983, 'צביה\r'),
(6984, 'צבעון\r'),
(6985, 'צובה\r'),
(6986, 'צופיה\r'),
(6987, 'צופים\r'),
(6988, 'צופית\r'),
(6989, 'צופר\r'),
(6990, 'צור הדסה\r'),
(6991, 'צור יגאל\r'),
(6992, 'צור משה\r'),
(6993, 'צור נתן\r'),
(6994, 'צוריאל\r'),
(6995, 'צורית\r'),
(6996, 'צורן\r'),
(6997, 'ציפורי\r'),
(6998, 'צלפון\r'),
(6999, 'צפריה\r'),
(7000, 'צפרירים\r'),
(7001, 'צפת\r'),
(7002, 'צרופה\r'),
(7003, 'צרעה\r'),
(7004, 'קבוצת יבנה\r'),
(7005, 'קדומים\r'),
(7006, 'קדימה\r'),
(7007, 'קדמה\r'),
(7008, 'קדמת צבי\r'),
(7009, 'קדרון\r'),
(7010, 'קדרים\r'),
(7011, 'קדש ברנע\r'),
(7012, 'קוממיות\r'),
(7013, 'קורנית\r'),
(7014, 'קטורה\r'),
(7015, 'קטיף\r'),
(7016, 'קטנה\r'),
(7017, 'קידר\r'),
(7018, 'קיסריה\r'),
(7019, 'קלחים\r'),
(7020, 'קליה\r'),
(7021, 'קלע\r'),
(7022, 'קציר\r'),
(7023, 'קצרין\r'),
(7024, 'קריות\r'),
(7025, 'קריית אונו\r'),
(7026, 'קריית ארבע\r'),
(7027, 'קריית אתא\r'),
(7028, 'קריית ביאליק\r'),
(7029, 'קריית גת\r'),
(7030, 'קריית חיים\r'),
(7031, 'קריית טבעון\r'),
(7032, 'קריית ים\r'),
(7033, 'קריית יערים\r'),
(7034, 'קריית מוצקין\r'),
(7035, 'קריית מלאכי\r'),
(7036, 'קריית נטפים\r'),
(7037, 'קריית ספר\r'),
(7038, 'קריית ענבים\r'),
(7039, 'קריית עקרון\r'),
(7040, 'קריית שמונה\r'),
(7041, 'קרני שומרון\r'),
(7042, 'קשת\r'),
(7043, 'ראש הניקרה\r'),
(7044, 'ראש העין\r'),
(7045, 'ראש פינה\r'),
(7046, 'ראש צורים\r'),
(7047, 'ראשון לציון\r'),
(7048, 'רבבה\r'),
(7049, 'רבדים\r'),
(7050, 'רביבים\r'),
(7051, 'רביד\r'),
(7052, 'רגבה\r'),
(7053, 'רגבים\r'),
(7054, 'רהט\r'),
(7055, 'רוגלית\r'),
(7056, 'רווחה\r'),
(7057, 'רוויה\r'),
(7058, 'רוחמה\r'),
(7059, 'רועי\r'),
(7060, 'רחוב\r'),
(7061, 'רחובות\r'),
(7062, 'ריחן\r'),
(7063, 'רימונים\r'),
(7064, 'רכסים\r'),
(7065, 'רם און\r'),
(7066, 'רמה\r'),
(7067, 'רמון\r'),
(7068, 'רמות\r'),
(7069, 'רמות השבים\r'),
(7070, 'רמות מאיר\r'),
(7071, 'רמות מנשה\r'),
(7072, 'רמות נפתלי\r'),
(7073, 'רמלה\r'),
(7074, 'רמת אפעל\r'),
(7075, 'רמת גן\r'),
(7076, 'רמת דוד\r'),
(7077, 'רמת הכובש\r'),
(7078, 'רמת השופט\r'),
(7079, 'רמת השרון\r'),
(7080, 'רמת יוחנן\r'),
(7081, 'רמת ישי\r'),
(7082, 'רמת מגשימים\r'),
(7083, 'רמת פנקס\r'),
(7084, 'רמת צבי\r'),
(7085, 'רמת רזיאל\r'),
(7086, 'רמת רחל\r'),
(7087, 'רנן\r'),
(7088, 'רעות\r'),
(7089, 'רעים\r'),
(7090, 'רעננה\r'),
(7091, 'רפיח ים\r'),
(7092, 'רקפת\r'),
(7093, 'רשפון\r'),
(7094, 'רשפים\r'),
(7095, 'רתמים\r'),
(7096, 'שאר ישוב\r'),
(7097, 'שבי ציון\r'),
(7098, 'שבי שומרון\r'),
(7099, 'שגב\r'),
(7100, 'שגב שלום\r'),
(7101, 'שדה אילן\r'),
(7102, 'שדה אליהו\r'),
(7103, 'שדה אליעזר\r'),
(7104, 'שדה בוקר\r'),
(7105, 'שדה דוד\r'),
(7106, 'שדה ורבורג\r'),
(7107, 'שדה יואב\r'),
(7108, 'שדה יעקב\r'),
(7109, 'שדה יצחק\r'),
(7110, 'שדה משה\r'),
(7111, 'שדה נחום\r'),
(7112, 'שדה נחמיה\r'),
(7113, 'שדה ניצן\r'),
(7114, 'שדה עוזיהו\r'),
(7115, 'שדה צבי\r'),
(7116, 'שדות ים\r'),
(7117, 'שדות מיכה\r'),
(7118, 'שדי אברהם\r'),
(7119, 'שדי חמד\r'),
(7120, 'שדי תרומות\r'),
(7121, 'שדמה\r'),
(7122, 'שדמות דבורה\r'),
(7123, 'שדמות מחולה\r'),
(7124, 'שדרות\r'),
(7125, 'שהם\r'),
(7126, 'שואבה\r'),
(7127, 'שובה\r'),
(7128, 'שובל\r'),
(7129, 'שומרה\r'),
(7130, 'שומריה\r'),
(7131, 'שומרת\r'),
(7132, 'שורש\r'),
(7133, 'שורשים\r'),
(7134, 'שושנת העמקים\r'),
(7135, 'שזור\r'),
(7136, 'שחר\r'),
(7137, 'שחרות\r'),
(7138, 'שיבולים\r'),
(7139, 'שיזפון\r'),
(7140, 'שילה\r'),
(7141, 'שילת\r'),
(7142, 'שלווה\r'),
(7143, 'שלוחות\r'),
(7144, 'שלומי\r'),
(7145, 'שליו\r'),
(7146, 'שמיר\r'),
(7147, 'שני\r'),
(7148, 'שניר\r'),
(7149, 'שעל\r'),
(7150, 'שעלבים\r'),
(7151, 'שער אפרים\r'),
(7152, 'שער הגולן\r'),
(7153, 'שער העמקים\r'),
(7154, 'שער מנשה\r'),
(7155, 'שערי תקווה\r'),
(7156, 'שפיים\r'),
(7157, 'שפיר\r'),
(7158, 'שפר\r'),
(7159, 'שפרעם\r'),
(7160, 'שקד\r'),
(7161, 'שקף\r'),
(7162, 'שרונה\r'),
(7163, 'שריד\r'),
(7164, 'שרשרת\r'),
(7165, 'שתולה\r'),
(7166, 'שתולים\r'),
(7167, 'תדהר\r'),
(7168, 'תובל\r'),
(7169, 'תומר\r'),
(7170, 'תושייה\r'),
(7171, 'תימורים\r'),
(7172, 'תירוש\r'),
(7173, 'תל אביב\r'),
(7174, 'תל יוסף\r'),
(7175, 'תל יצחק\r'),
(7176, 'תל מונד\r'),
(7177, 'תל עדשים\r'),
(7178, 'תל קציר\r'),
(7179, 'תל שבע\r'),
(7180, 'תל תאומים\r'),
(7181, 'תלם\r'),
(7182, 'תלמי אליהו\r'),
(7183, 'תלמי אלעזר\r'),
(7184, 'תלמי בילו\r'),
(7185, 'תלמי יוסף\r'),
(7186, 'תלמי יחיאל\r'),
(7187, 'תלמי יפה\r'),
(7188, 'תלמי מנשה\r'),
(7189, 'תלמים\r'),
(7190, 'תנובות\r'),
(7191, 'תעוז\r'),
(7192, 'תפוח\r'),
(7193, 'תפרח\r'),
(7194, 'תקומה\r'),
(7195, 'תקוע\r'),
(7196, 'תרום');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `politics`
--

CREATE TABLE `politics` (
  `Politics_Id` tinyint(4) NOT NULL,
  `Politics_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `politics`
--

INSERT INTO `politics` (`Politics_Id`, `Politics_Str`) VALUES
(1, 'ימין'),
(2, 'ימין מתון '),
(3, 'מרכז'),
(4, 'שמאל'),
(5, 'שמאל מתון'),
(6, 'אין דעה');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `religion`
--

CREATE TABLE `religion` (
  `Religion_Id` tinyint(4) NOT NULL,
  `Religion_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `religion`
--

INSERT INTO `religion` (`Religion_Id`, `Religion_Str`) VALUES
(1, 'יהודי'),
(2, 'נוצרי'),
(3, 'מוסלמי'),
(4, 'בודהיסט'),
(5, 'אחר');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `religion_ref`
--

CREATE TABLE `religion_ref` (
  `Religion_Ref_Id` tinyint(4) NOT NULL,
  `Religion_Ref_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `religion_ref`
--

INSERT INTO `religion_ref` (`Religion_Ref_Id`, `Religion_Ref_Str`) VALUES
(1, 'חילוני'),
(2, 'מסורתי'),
(3, 'דתי'),
(4, 'חרדי'),
(5, 'אורתודוכסי'),
(6, 'אחר');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `smoking_habbit`
--

CREATE TABLE `smoking_habbit` (
  `Smoking_Habbit_Id` tinyint(4) NOT NULL,
  `Smoking_Habbit_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `smoking_habbit`
--

INSERT INTO `smoking_habbit` (`Smoking_Habbit_Id`, `Smoking_Habbit_Str`) VALUES
(1, 'מעשן קל'),
(2, 'מעשן כבד'),
(3, 'מדי פעם'),
(4, 'מעשן'),
(5, 'מנסה להפסיק');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `users_profile`
--

CREATE TABLE `users_profile` (
  `Id` int(11) NOT NULL,
  `Open_Date` date DEFAULT NULL,
  `Gender_Id` tinyint(4) DEFAULT NULL,
  `Gender_Str` text DEFAULT NULL,
  `DOB` date DEFAULT NULL,
  `Name` varchar(45) DEFAULT NULL,
  `Pass` varchar(255) DEFAULT NULL,
  `Email` varchar(45) DEFAULT NULL,
  `Zone_Id` tinyint(4) DEFAULT 0,
  `Zone_Str` text DEFAULT NULL,
  `Place_Id` int(11) DEFAULT 0,
  `Place_Str` text DEFAULT NULL,
  `Email_Validation` bit(1) DEFAULT NULL,
  `Family_Status_Id` tinyint(4) DEFAULT 0,
  `Family_Status_Str` text DEFAULT NULL,
  `Economic_Id` tinyint(4) DEFAULT 0,
  `Economic_Str` text DEFAULT NULL,
  `Occupation_Id` tinyint(4) DEFAULT 0,
  `Occupation_Str` text DEFAULT NULL,
  `Childs_Pos_Id` tinyint(4) DEFAULT 0,
  `Childs_Pos_Str` text DEFAULT NULL,
  `Childs_Num_Id` tinyint(4) DEFAULT 0,
  `Childs_Num_Str` text DEFAULT NULL,
  `Education_Id` tinyint(4) DEFAULT NULL,
  `Education_Str` text DEFAULT NULL,
  `Religion_Id` tinyint(4) DEFAULT 0,
  `Religion_Str` text DEFAULT NULL,
  `Religion_Ref_Id` tinyint(4) DEFAULT NULL,
  `Religion_Ref_Str` text DEFAULT NULL,
  `Origin_Id` tinyint(4) DEFAULT NULL,
  `Origin_Str` text DEFAULT NULL,
  `lang1` text DEFAULT NULL,
  `lang2` text DEFAULT NULL,
  `Hobbies` tinytext DEFAULT NULL,
  `Spending` tinytext DEFAULT NULL,
  `Politics_Id` tinyint(4) DEFAULT NULL,
  `Politics_Str` text DEFAULT NULL,
  `Smoking_Habbit_Id` tinyint(4) DEFAULT NULL,
  `Smoking_Habbit_Str` text DEFAULT NULL,
  `Drinking_Habbit_Id` tinyint(4) DEFAULT 0,
  `Drinking_Habbit_Str` text DEFAULT NULL,
  `Vegitrain_Id` tinyint(4) DEFAULT NULL,
  `Vegitrain_Str` text DEFAULT NULL,
  `Height_Id` tinytext DEFAULT NULL,
  `Height_Str` text DEFAULT NULL,
  `Weight_Id` tinyint(4) DEFAULT 0,
  `Weight_Str` text DEFAULT NULL,
  `Hair_Type_Id` tinyint(4) DEFAULT 0,
  `Hair_Type_Str` text DEFAULT NULL,
  `Hair_Color_Id` tinyint(4) DEFAULT 0,
  `Hair_Color_Str` text DEFAULT NULL,
  `Body_Type_Id` tinyint(4) DEFAULT 0,
  `Body_Type_Str` text DEFAULT NULL,
  `Look_Type_Id` tinyint(4) DEFAULT 0,
  `Look_Type_Str` text DEFAULT NULL,
  `Who_Am_I` mediumtext DEFAULT NULL,
  `I_Looking_For` mediumtext DEFAULT NULL,
  `Ideal_Relation_Is` mediumtext DEFAULT NULL,
  `Age` tinyint(4) DEFAULT NULL,
  `Login_Date` date DEFAULT NULL,
  `Login_Time` time DEFAULT NULL,
  `Send_Me_Mail_For_Msg` tinyint(4) DEFAULT 1,
  `Favorite_Movies` text DEFAULT NULL,
  `Favorite_TV` text DEFAULT NULL,
  `Favorite_Books` text DEFAULT NULL,
  `zodiac` text DEFAULT NULL,
  `email_verified` tinyint(1) NOT NULL DEFAULT 0,
  `verification_token` varchar(255) DEFAULT NULL,
  `verification_sent_at` datetime DEFAULT NULL,
  `look_gender` int(11) DEFAULT NULL,
  `Sport` text DEFAULT NULL,
  `last_seen` datetime DEFAULT NULL,
  `Is_Frozen` tinyint(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `users_profile`
--

INSERT INTO `users_profile` (`Id`, `Open_Date`, `Gender_Id`, `Gender_Str`, `DOB`, `Name`, `Pass`, `Email`, `Zone_Id`, `Zone_Str`, `Place_Id`, `Place_Str`, `Email_Validation`, `Family_Status_Id`, `Family_Status_Str`, `Economic_Id`, `Economic_Str`, `Occupation_Id`, `Occupation_Str`, `Childs_Pos_Id`, `Childs_Pos_Str`, `Childs_Num_Id`, `Childs_Num_Str`, `Education_Id`, `Education_Str`, `Religion_Id`, `Religion_Str`, `Religion_Ref_Id`, `Religion_Ref_Str`, `Origin_Id`, `Origin_Str`, `lang1`, `lang2`, `Hobbies`, `Spending`, `Politics_Id`, `Politics_Str`, `Smoking_Habbit_Id`, `Smoking_Habbit_Str`, `Drinking_Habbit_Id`, `Drinking_Habbit_Str`, `Vegitrain_Id`, `Vegitrain_Str`, `Height_Id`, `Height_Str`, `Weight_Id`, `Weight_Str`, `Hair_Type_Id`, `Hair_Type_Str`, `Hair_Color_Id`, `Hair_Color_Str`, `Body_Type_Id`, `Body_Type_Str`, `Look_Type_Id`, `Look_Type_Str`, `Who_Am_I`, `I_Looking_For`, `Ideal_Relation_Is`, `Age`, `Login_Date`, `Login_Time`, `Send_Me_Mail_For_Msg`, `Favorite_Movies`, `Favorite_TV`, `Favorite_Books`, `zodiac`, `email_verified`, `verification_token`, `verification_sent_at`, `look_gender`, `Sport`, `last_seen`, `Is_Frozen`) VALUES
(157, '2026-04-10', 2, 'אישה', '2000-04-12', 'davc44', '$2y$10$RfXCC8TK1W8qCnUJMEkffeSZAh67Hg/Y1lIyooSH/mMINc3gd1QkW', 'davc222@gmail.com', 1, 'צפון', 6158, 'אבני חפץ', b'1', 0, 'אלמנה', 0, NULL, 0, 'היי-טק', 0, NULL, 0, '1', NULL, 'הנדסאי', 0, 'יהודי', NULL, 'חילוני', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'מדי פעם', 0, 'באירועים', NULL, 'בריאותית', NULL, '156  ס\"מ', 0, NULL, 0, 'ארוך', 0, 'הרבה צבעים', 0, 'ממוצע', 0, 'טוב מאוד', NULL, NULL, NULL, NULL, NULL, NULL, 1, NULL, NULL, NULL, NULL, 1, NULL, '2026-04-10 11:34:39', 1, NULL, '2026-04-12 05:16:49', 0),
(158, '2026-04-11', 1, 'גבר', '2000-04-12', 'davc33', '$2y$10$h299EtPC40A3KusVrOSyoeidnx7p9zWg6JTXipG5e6yE6zltMIFXO', 'davc22@gmail.com', 1, 'צפון', 6154, 'אבן שמואל\r', b'1', 0, NULL, 0, NULL, 0, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, NULL, NULL, NULL, NULL, 1, NULL, '2026-04-11 20:11:44', 2, NULL, '2026-04-12 19:55:40', 0);

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `user_pics`
--

CREATE TABLE `user_pics` (
  `Pic_Num` int(11) NOT NULL,
  `Id` int(11) DEFAULT NULL,
  `Pic_Name` varchar(45) DEFAULT NULL,
  `Pic_Title` varchar(45) DEFAULT NULL,
  `Pic_Status` tinyint(1) DEFAULT NULL,
  `Pic_Status_Str` varchar(45) DEFAULT NULL,
  `Main_Pic` tinyint(1) DEFAULT NULL,
  `Main_Pic_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `user_pics`
--

INSERT INTO `user_pics` (`Pic_Num`, `Id`, `Pic_Name`, `Pic_Title`, `Pic_Status`, `Pic_Status_Str`, `Main_Pic`, `Main_Pic_Str`) VALUES
(279, 151, 'user_151_1775551907_cc5a40.jpg', '', 1, 'פעיל', 1, 'כן'),
(280, 150, 'user_150_1775567940_c10497.jpg', '', 1, 'פעיל', 1, 'לא'),
(281, 150, 'user_150_1775567961_804fa8.jpg', '', 1, 'פעיל', 1, 'לא'),
(282, 150, 'user_150_1775567989_68a52e.jpg', '', 1, 'פעיל', 1, 'כן'),
(283, 152, 'user_152_1775610996_d85867.jpg', '', 1, 'פעיל', 1, 'כן'),
(284, 155, 'user_155_1775636652_b63610.jpg', '', 1, 'פעיל', 1, 'כן'),
(285, 156, 'user_156_1775796961_c6a4ca.jpg', '', 1, 'פעיל', 1, 'כן'),
(286, 157, 'user_157_1775810126_5ce667.jpg', '', 1, 'פעיל', 1, 'כן'),
(287, 158, 'user_158_1775927987_eea91f.jpg', '', 1, 'פעיל', 1, 'כן'),
(288, 158, 'user_158_1775927999_1b0661.jpg', '', 1, 'פעיל', 0, 'לא'),
(289, 158, 'user_158_1775928022_0b8ec0.jpg', '', 1, 'פעיל', 0, 'לא');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `user_search_preferences`
--

CREATE TABLE `user_search_preferences` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `age_min` tinyint(4) DEFAULT 18,
  `age_max` tinyint(4) DEFAULT 80,
  `height_min` smallint(6) DEFAULT 140,
  `height_max` smallint(6) DEFAULT 220,
  `children` enum('yes','no','') DEFAULT '',
  `zone` text DEFAULT NULL,
  `religion` text DEFAULT NULL,
  `religion_ref` text DEFAULT NULL,
  `smoking` text DEFAULT NULL,
  `drinking` text DEFAULT NULL,
  `family_status` text DEFAULT NULL,
  `body_type` text DEFAULT NULL,
  `vegitrain` text DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `user_search_preferences`
--

INSERT INTO `user_search_preferences` (`id`, `user_id`, `age_min`, `age_max`, `height_min`, `height_max`, `children`, `zone`, `religion`, `religion_ref`, `smoking`, `drinking`, `family_status`, `body_type`, `vegitrain`, `updated_at`) VALUES
(2, 150, 25, 73, 140, 219, '', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-04 09:36:40'),
(14, 151, 25, 60, 160, 190, '', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-05 18:59:49'),
(16, 152, 25, 65, 161, 220, '', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-08 20:38:55'),
(20, 158, 25, 65, 140, 220, '', '[\"4\",\"1\"]', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-12 02:06:26');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `vegitrain`
--

CREATE TABLE `vegitrain` (
  `Vegitrain_Id` tinyint(4) NOT NULL,
  `Vegitrain_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `vegitrain`
--

INSERT INTO `vegitrain` (`Vegitrain_Id`, `Vegitrain_Str`) VALUES
(1, 'לא'),
(2, 'בריאותית'),
(3, 'אידאולוגית');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `views`
--

CREATE TABLE `views` (
  `Num` int(11) NOT NULL,
  `Id` int(11) DEFAULT NULL,
  `ById` int(11) DEFAULT NULL,
  `Date` datetime DEFAULT NULL,
  `New` tinyint(4) DEFAULT NULL,
  `Deleted_By_Id` tinyint(4) DEFAULT 0,
  `Deleted_By_ById` tinyint(4) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `views`
--

INSERT INTO `views` (`Num`, `Id`, `ById`, `Date`, `New`, `Deleted_By_Id`, `Deleted_By_ById`) VALUES
(201, 156, 157, '2026-04-11 10:12:24', 0, 0, 0),
(202, 157, 156, '2026-04-11 19:31:02', 0, 0, 0),
(203, 158, 157, '2026-04-11 22:18:49', 0, 0, 0),
(204, 157, 158, '2026-04-12 05:21:42', 1, 0, 0);

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `weight`
--

CREATE TABLE `weight` (
  `Weight_Id` tinyint(4) NOT NULL,
  `Weight_Str` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `weight`
--

INSERT INTO `weight` (`Weight_Id`, `Weight_Str`) VALUES
(1, '45  ק\"ג'),
(2, '46  ק\"ג'),
(3, '47  ק\"ג'),
(4, '48  ק\"ג'),
(5, '49  ק\"ג'),
(6, '50  ק\"ג'),
(7, '51  ק\"ג'),
(8, '52  ק\"ג'),
(9, '53  ק\"ג'),
(10, '54  ק\"ג'),
(11, '55  ק\"ג'),
(12, '56  ק\"ג'),
(13, '57  ק\"ג'),
(14, '58  ק\"ג'),
(15, '59  ק\"ג'),
(16, '60  ק\"ג'),
(17, '61  ק\"ג'),
(18, '62  ק\"ג '),
(19, '63  ק\"ג '),
(20, '64  ק\"ג  '),
(21, '65  ק\"ג '),
(22, '66  ק\"ג '),
(23, '67  ק\"ג   '),
(24, '68  ק\"ג '),
(25, '69  ק\"ג  '),
(26, '70  ק\"ג '),
(27, '71  ק\"ג '),
(28, '72  ק\"ג '),
(29, '73  ק\"ג '),
(30, '74  ק\"ג '),
(31, '75  ק\"ג '),
(32, '76  ק\"ג '),
(33, '77  ק\"ג '),
(34, '78  ק\"ג  '),
(35, '79 ק\"ג '),
(36, '80 ק\"ג '),
(37, '81 ק\"ג '),
(38, '82 ק\"ג '),
(39, '83 ק\"ג '),
(40, '84 ק\"ג '),
(41, '85 ק\"ג '),
(42, '86 ק\"ג '),
(43, '87 ק\"ג '),
(44, '88 ק\"ג '),
(45, '89 ק\"ג '),
(46, '90 ק\"ג '),
(47, '91 ק\"ג '),
(48, '92 ק\"ג '),
(49, '93 ק\"ג '),
(50, '94 ק\"ג '),
(51, '95 ק\"ג '),
(52, '96 ק\"ג '),
(53, '97 ק\"ג '),
(54, '98 ק\"ג '),
(55, '99 ק\"ג '),
(56, '101 ק\"ג '),
(57, '102 ק\"ג '),
(58, '103 ק\"ג '),
(59, '104 ק\"ג '),
(60, '105 ק\"ג '),
(61, '106 ק\"ג '),
(62, '108 ק\"ג '),
(63, '109 ק\"ג '),
(64, '110 ק\"ג '),
(65, '111 ק\"ג '),
(66, '112 ק\"ג '),
(67, '113 ק\"ג '),
(68, '114 ק\"ג '),
(69, '115 ק\"ג '),
(70, '116 ק\"ג '),
(71, '117 ק\"ג '),
(72, '118 ק\"ג '),
(73, '119 ק\"ג '),
(74, '120 ק\"ג '),
(75, '121 ק\"ג '),
(76, '122 ק\"ג '),
(77, '123 ק\"ג '),
(78, '124 ק\"ג '),
(79, '125 ק\"ג '),
(80, '126 ק\"ג '),
(81, '127 ק\"ג '),
(82, '128 ק\"ג '),
(83, '129 ק\"ג '),
(84, '130 ק\"ג ');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `whoinsite`
--

CREATE TABLE `whoinsite` (
  `Num` tinyint(4) NOT NULL,
  `Id` int(11) DEFAULT NULL,
  `Ip` varchar(45) DEFAULT NULL,
  `Update_Time` int(11) DEFAULT NULL,
  `Time` time DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `whoinsite`
--

INSERT INTO `whoinsite` (`Num`, `Id`, `Ip`, `Update_Time`, `Time`) VALUES
(88, 407, NULL, 1367123166, '06:26:00');

-- --------------------------------------------------------

--
-- מבנה טבלה עבור טבלה `zone`
--

CREATE TABLE `zone` (
  `Zone_Id` tinyint(4) NOT NULL,
  `Zone_Str` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- הוצאת מידע עבור טבלה `zone`
--

INSERT INTO `zone` (`Zone_Id`, `Zone_Str`) VALUES
(1, 'צפון'),
(2, 'שרון'),
(3, 'מרכז'),
(4, 'ירושליים ויו\"ש'),
(5, 'השפלה'),
(6, 'דרום'),
(7, 'אילת והסביבה'),
(8, 'אחר');

--
-- Indexes for dumped tables
--

--
-- אינדקסים לטבלה `age`
--
ALTER TABLE `age`
  ADD PRIMARY KEY (`Age_Id`);

--
-- אינדקסים לטבלה `blocked`
--
ALTER TABLE `blocked`
  ADD PRIMARY KEY (`Num`);

--
-- אינדקסים לטבלה `blocked_users`
--
ALTER TABLE `blocked_users`
  ADD PRIMARY KEY (`Num`),
  ADD UNIQUE KEY `uniq_block` (`Id`,`Blocked_ById`),
  ADD KEY `idx_blocked_id` (`Id`),
  ADD KEY `idx_blocked_by` (`Blocked_ById`);

--
-- אינדקסים לטבלה `body_type`
--
ALTER TABLE `body_type`
  ADD PRIMARY KEY (`Body_Type_Id`);

--
-- אינדקסים לטבלה `chat_typing`
--
ALTER TABLE `chat_typing`
  ADD PRIMARY KEY (`from_user_id`,`to_user_id`);

--
-- אינדקסים לטבלה `childs_num`
--
ALTER TABLE `childs_num`
  ADD PRIMARY KEY (`Childs_Num_Id`);

--
-- אינדקסים לטבלה `childs_pos`
--
ALTER TABLE `childs_pos`
  ADD PRIMARY KEY (`Childs_Pos_Id`);

--
-- אינדקסים לטבלה `drinking_habbit`
--
ALTER TABLE `drinking_habbit`
  ADD PRIMARY KEY (`Drinking_Habbit_Id`);

--
-- אינדקסים לטבלה `economic`
--
ALTER TABLE `economic`
  ADD PRIMARY KEY (`Economic_Id`);

--
-- אינדקסים לטבלה `education`
--
ALTER TABLE `education`
  ADD PRIMARY KEY (`Education_Id`);

--
-- אינדקסים לטבלה `family_status`
--
ALTER TABLE `family_status`
  ADD PRIMARY KEY (`Family_Status_Id`);

--
-- אינדקסים לטבלה `gender`
--
ALTER TABLE `gender`
  ADD PRIMARY KEY (`Gender_Id`);

--
-- אינדקסים לטבלה `hair_color`
--
ALTER TABLE `hair_color`
  ADD PRIMARY KEY (`Hair_Color_Id`);

--
-- אינדקסים לטבלה `hair_type`
--
ALTER TABLE `hair_type`
  ADD PRIMARY KEY (`Hair_Type_Id`);

--
-- אינדקסים לטבלה `height`
--
ALTER TABLE `height`
  ADD PRIMARY KEY (`Height_Id`);

--
-- אינדקסים לטבלה `langs`
--
ALTER TABLE `langs`
  ADD PRIMARY KEY (`Lang_Id`);

--
-- אינדקסים לטבלה `look_gender`
--
ALTER TABLE `look_gender`
  ADD PRIMARY KEY (`Id`);

--
-- אינדקסים לטבלה `look_type`
--
ALTER TABLE `look_type`
  ADD PRIMARY KEY (`Look_Type_Id`);

--
-- אינדקסים לטבלה `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`Msg_Num`);

--
-- אינדקסים לטבלה `message_typing`
--
ALTER TABLE `message_typing`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uniq_pair` (`user_id`,`target_id`);

--
-- אינדקסים לטבלה `occupation`
--
ALTER TABLE `occupation`
  ADD PRIMARY KEY (`Occupation_Id`);

--
-- אינדקסים לטבלה `origin`
--
ALTER TABLE `origin`
  ADD PRIMARY KEY (`Origin_Id`);

--
-- אינדקסים לטבלה `place`
--
ALTER TABLE `place`
  ADD PRIMARY KEY (`Place_Id`);

--
-- אינדקסים לטבלה `politics`
--
ALTER TABLE `politics`
  ADD PRIMARY KEY (`Politics_Id`);

--
-- אינדקסים לטבלה `religion`
--
ALTER TABLE `religion`
  ADD PRIMARY KEY (`Religion_Id`);

--
-- אינדקסים לטבלה `religion_ref`
--
ALTER TABLE `religion_ref`
  ADD PRIMARY KEY (`Religion_Ref_Id`);

--
-- אינדקסים לטבלה `smoking_habbit`
--
ALTER TABLE `smoking_habbit`
  ADD PRIMARY KEY (`Smoking_Habbit_Id`);

--
-- אינדקסים לטבלה `users_profile`
--
ALTER TABLE `users_profile`
  ADD PRIMARY KEY (`Id`);

--
-- אינדקסים לטבלה `user_pics`
--
ALTER TABLE `user_pics`
  ADD PRIMARY KEY (`Pic_Num`);

--
-- אינדקסים לטבלה `user_search_preferences`
--
ALTER TABLE `user_search_preferences`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `user_id` (`user_id`);

--
-- אינדקסים לטבלה `vegitrain`
--
ALTER TABLE `vegitrain`
  ADD PRIMARY KEY (`Vegitrain_Id`);

--
-- אינדקסים לטבלה `views`
--
ALTER TABLE `views`
  ADD PRIMARY KEY (`Num`);

--
-- אינדקסים לטבלה `weight`
--
ALTER TABLE `weight`
  ADD PRIMARY KEY (`Weight_Id`);

--
-- אינדקסים לטבלה `whoinsite`
--
ALTER TABLE `whoinsite`
  ADD PRIMARY KEY (`Num`);

--
-- אינדקסים לטבלה `zone`
--
ALTER TABLE `zone`
  ADD PRIMARY KEY (`Zone_Id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `age`
--
ALTER TABLE `age`
  MODIFY `Age_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=74;

--
-- AUTO_INCREMENT for table `blocked`
--
ALTER TABLE `blocked`
  MODIFY `Num` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `blocked_users`
--
ALTER TABLE `blocked_users`
  MODIFY `Num` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `body_type`
--
ALTER TABLE `body_type`
  MODIFY `Body_Type_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `childs_num`
--
ALTER TABLE `childs_num`
  MODIFY `Childs_Num_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `childs_pos`
--
ALTER TABLE `childs_pos`
  MODIFY `Childs_Pos_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `drinking_habbit`
--
ALTER TABLE `drinking_habbit`
  MODIFY `Drinking_Habbit_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `economic`
--
ALTER TABLE `economic`
  MODIFY `Economic_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `education`
--
ALTER TABLE `education`
  MODIFY `Education_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `family_status`
--
ALTER TABLE `family_status`
  MODIFY `Family_Status_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `gender`
--
ALTER TABLE `gender`
  MODIFY `Gender_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `hair_color`
--
ALTER TABLE `hair_color`
  MODIFY `Hair_Color_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `hair_type`
--
ALTER TABLE `hair_type`
  MODIFY `Hair_Type_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `height`
--
ALTER TABLE `height`
  MODIFY `Height_Id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;

--
-- AUTO_INCREMENT for table `langs`
--
ALTER TABLE `langs`
  MODIFY `Lang_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT for table `look_gender`
--
ALTER TABLE `look_gender`
  MODIFY `Id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `look_type`
--
ALTER TABLE `look_type`
  MODIFY `Look_Type_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `messages`
--
ALTER TABLE `messages`
  MODIFY `Msg_Num` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=303;

--
-- AUTO_INCREMENT for table `message_typing`
--
ALTER TABLE `message_typing`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=116;

--
-- AUTO_INCREMENT for table `occupation`
--
ALTER TABLE `occupation`
  MODIFY `Occupation_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=69;

--
-- AUTO_INCREMENT for table `origin`
--
ALTER TABLE `origin`
  MODIFY `Origin_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `place`
--
ALTER TABLE `place`
  MODIFY `Place_Id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7197;

--
-- AUTO_INCREMENT for table `politics`
--
ALTER TABLE `politics`
  MODIFY `Politics_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `religion`
--
ALTER TABLE `religion`
  MODIFY `Religion_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `religion_ref`
--
ALTER TABLE `religion_ref`
  MODIFY `Religion_Ref_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `smoking_habbit`
--
ALTER TABLE `smoking_habbit`
  MODIFY `Smoking_Habbit_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `users_profile`
--
ALTER TABLE `users_profile`
  MODIFY `Id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=159;

--
-- AUTO_INCREMENT for table `user_pics`
--
ALTER TABLE `user_pics`
  MODIFY `Pic_Num` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=290;

--
-- AUTO_INCREMENT for table `user_search_preferences`
--
ALTER TABLE `user_search_preferences`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT for table `vegitrain`
--
ALTER TABLE `vegitrain`
  MODIFY `Vegitrain_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `views`
--
ALTER TABLE `views`
  MODIFY `Num` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=205;

--
-- AUTO_INCREMENT for table `weight`
--
ALTER TABLE `weight`
  MODIFY `Weight_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=85;

--
-- AUTO_INCREMENT for table `whoinsite`
--
ALTER TABLE `whoinsite`
  MODIFY `Num` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=89;

--
-- AUTO_INCREMENT for table `zone`
--
ALTER TABLE `zone`
  MODIFY `Zone_Id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
